Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: Quarkus Security provides a RESTEasy Reactive filter that can protect your applications against a https://owasp.org/www-community/attacks/csrf[Cross-Site Request Forgery] attack. For more information, see xref:security-csrf-prevention.adoc[Cross-Site Request Forgery Prevention].
zh_cn: Quarkus Security提供的RESTEasy Reactive过滤器可以保护您的应用程序免遭 link:https://owasp.org/www-community/attacks/csrf[跨站请求伪造] 攻击。请阅读《 link:security-csrf-prevention.html[跨站请求伪造预防] 指南》以了解更多信息。

source: Quarkus Security uses `HttpAuthenticationMechanism` to extract the authentication credentials from the HTTP request and delegates them to `IdentityProvider` to convert the credentials to `SecurityIdentity`. For example, the credentials can come from the `Authorization` header, client HTTPS certificates, or cookies.
zh_cn: Quarkus Security使用 `HttpAuthenticationMechanism` 从HTTP请求中提取认证凭证，并委托给 `IdentityProvider` 来完成这些凭证到 `SecurityIdentity` 的转换。例如，凭证可能来自于HTTP `Authorization` 头、客户端HTTPS证书或cookies。

source: Quarkus Tools in your favorite IDE
zh_cn: 在你喜欢的IDE中使用Quarkus扩展工具

source: Quarkus URL for git clone referenced by the documentation.
zh_cn: 文档所引用的git clone的Quarkus URL。

source: Quarkus URL to main blob source tree; used for referencing source files.
zh_cn: 指向主blob源树的Quarkus URL；用于引用源文件。

source: Quarkus URL to main source archive.
zh_cn: 指向主源存档的Quarkus URL。

source: Quarkus URL to main source tree root; used for referencing directories.
zh_cn: 指向主源树根的Quarkus URL；用于引用目录。

source: Quarkus URL to set of container images delivered for Quarkus.
zh_cn: 指向提供给Quarkus的容器镜像集的Quarkus URL。

source: Quarkus URL to the issues page.
zh_cn: 指向问题页的Quarkus URL。

source: Quarkus Version
zh_cn: Quarkus版本

source: Quarkus World Tour
zh_cn: Quarkus世界巡演

source: Quarkus aids you on your journey to reactive. Quarkus is based on a <a href="https://quarkus.io/version/main/guides/quarkus-reactive-architecture">reactive core</a> allowing your application to mix reactive and imperative components. As an example, you can implement reactive HTTP endpoint using the <a href="https://quarkus.io/guides/resteasy-reactive">RESTEasy Reactive extension</a> as follows:
zh_cn: Quarkus可以帮助您实现响应式的旅程。Quarkus基于<a href="https://quarkus.io/version/main/guides/quarkus-reactive-architecture">响应式核心</a>，允许您的应用程序混合响应式和指令式组件。例如，您可以使用<a href="https://quarkus.io/guides/resteasy-reactive">RESTEasy 响应式扩展</a>实现响应式HTTP端点，具体如下：

source: Quarkus also provides RestAssured integration that updates the default port used by RestAssured before the tests are run, so no additional configuration should be required.
zh_cn: Quarkus还提供了RestAssured集成用以在测试运行前更新RestAssured使用的默认端口，因而不需要额外的配置。

source: Quarkus also supports https://eclipse-ee4j.github.io/jsonb-api/[JSON-B] so, if you prefer JSON-B over Jackson, you can create a project relying on the RESTEasy Reactive JSON-B extension instead:
zh_cn: Quarkus也支持 link:https://eclipse-ee4j.github.io/jsonb-api/[JSON-B] ，因此，如果你喜欢JSON-B而不是Jackson，你可以创建一个依赖RESTEasy Reactive JSON-B扩展的项目：

source: Quarkus also supports role-based access control (RBAC). For more information about RBAC and other authorization options in Quarkus, see xref:security-authorization.adoc[Security authorization].
zh_cn: Quarkus也支持基于角色的访问控制（RBAC）。关于RBAC和Quarkus中其他授权选项的更多信息，请参见 link:security-authorization.html[安全授权] 。

source: Quarkus applications are designed to run in containers.
zh_cn: Quarkus应用程序被设计为在容器中运行。

source: Quarkus applications are optimised for low memory usage and fast startup times.
zh_cn: Quarkus应用程序针对低内存使用和快速启动时间进行了优化。

source: Quarkus applications can access and use the Vert.x APIs.
zh_cn: Quarkus应用程序能够访问和使用Vert.x APIs。

source: Quarkus autodetects batch types for incoming channels and sets batch configuration automatically. You can configure batch mode explicitly with `mp.messaging.incoming.$channel.batch` property.
zh_cn: Quarkus自动检测incoming channels 的批处理类型并自动设置批处理配置。您可以用 `mp.messaging.incoming.$channel.batch` 配置批处理模式。

source: Quarkus automatically generates serializers and deserializers for channels where:
zh_cn: 以下情况下，Quarkus会自动为 channels 生成序列化器和反序列化器：

source: Quarkus automatically includes the resources present in `META-INF/resources` (the web resources) but, outside of this directory, you are on your own.
zh_cn: Quarkus自动包括存在于 `META-INF/resources` (网络资源）的资源，但是，在这个目录之外，你就得靠自己了。

source: Quarkus can compress the produced native executable using UPX. More details on xref:./upx.adoc[UPX Compression documentation].
zh_cn: Quarkus可以使用UPX压缩产生的原生可执行文件。更多细节见 xref:./upx.adoc[UPX压缩文档] 。

source: Quarkus comes with a Transaction Manager and uses it to coordinate and expose transactions to your applications. Each extension dealing with persistence will integrate with it for you. And you will explicitly interact with transactions via CDI. This guide will walk you through all that.
zh_cn: Quarkus自带一个事务管理器，并使用它来协调和暴露事务给你的应用程序。每个处理持久性的扩展都会与它集成。而且你将通过CDI明确地与事务进行交互。本指南将指导你完成这一切。

source: Quarkus comes with a toolchain enabling developers from live reload all the way down to deploying a Kubernetes application. In addition there are plugins and extensions to all major IDEs.
zh_cn: Quarkus提供了一个工具链，支持开发人员从实时重新加载一直到部署Kubernetes应用程序。此外，所有主流IDE都有插件和扩展。

source: Quarkus comes with a toolchain to help you at all development stages. You can use Maven or Gradle as build tool. And we offer a CLI that is convenient to use (coming soon).
zh_cn: Quarkus自带的工具链可以在各个开发阶段帮助你。你可以使用Maven或Gradle作为构建工具。我们还提供了一个方便使用的CLI（即将推出）。

source: Quarkus comes with built-in security to allow for Role-Based Access Control (link:https://en.wikipedia.org/wiki/Role-based_access_control[RBAC]) based on the common security annotations `@RolesAllowed`, `@DenyAll`, `@PermitAll` on REST endpoints and CDI beans. An example of an endpoint that makes use of both JAX-RS and Common Security annotations to describe and secure its endpoints is given in <<subject-example>>. Quarkus also provides the `io.quarkus.security.Authenticated` annotation that will permit any authenticated user to access the resource (equivalent to `@RolesAllowed("**")`).
zh_cn: Quarkus 具有内置的安全性，允许在 REST 节点和 CDI Bean 上使用基于通用安全注解 `@RolesAllowed` , `@DenyAll` , `@PermitAll` 的基于角色的访问控制 link:https://en.wikipedia.org/wiki/Role-based_access_control[（RBAC] ）。在 link:#subject-example[[subject-example]] 中给出了一个同时使用 JAX-RS 和通用安全注解来描述和保护其节点的例子。Quarkus 还提供了 `io.quarkus.security.Authenticated` 注解，它将允许任何经过认证的用户访问该资源（相当于 `@RolesAllowed("**")` ）。

source: Quarkus configuration
zh_cn: Quarkus配置

source: Quarkus currently only supports a subset of the functionalities that Spring @Scheduled provides with more features being planned. Currently, the `fixedDelay` and `fixedDelayString` parameters are not supported, in other words, `@Scheduled` methods are always executed independently.
zh_cn: Quarkus目前只支持Spring @Scheduled所提供功能的一个子集，更多的功能正在计划当中。目前暂不支持 `fixedDelay` 和 `fixedDelayString` 参数，换句话说， `@Scheduled` 方法总是被独立地执行。

source: Quarkus does that for you automatically by analyzing the REST methods at build time and that's why we didn't need any reflection registration in the first part of this guide.
zh_cn: Quarkus通过在构建时分析REST方法自动为你执行此操，这就是为什么我们在本指南的第一部分不需要任何反射注册。

source: Quarkus exposes all Kafka related application properties, prefixed with `kafka.` or `KAFKA_` inside a configuration map with `default-kafka-broker` name. This configuration is used to establish the connection with the Kafka broker.
zh_cn: Quarkus公开了所有与Kafka相关的应用属性，这些属性使用 `default-kafka-broker` 名称加 `kafka.` 或 `KAFKA_` 的前缀 。这个配置被用来建立与Kafka broker的连接。

source: Quarkus extensions optimize your applications by pushing as much work as possible to the build operation. This guide explains the rationale of Quarkus extensions and guides you through authoring your own extensions.
zh_cn: Quarkus扩展通过将尽可能多的工作推给构建操作来优化你的应用程序。本指南解释了Quarkus扩展的基本原理，并指导你编写你自己的扩展。

source: Quarkus focuses on the simplest and most useful way to use a given feature, trimming it to its most useful essence. This includes upfront analysis on how to best use a feature and guiding you in what we think is the best way to do things.
zh_cn: Quarkus专注于使用给定特性最简单和最有用的方法，将其裁剪到最有用的本质。这包括关于如何最好地使用一个功能的前期分析，以及指导您我们认为最好的做事方式。

source: Quarkus generates a UUID that changes between two executions (including in dev mode). So, you are sure no other consumer uses it, and you receive a new unique group id every time your application starts.
zh_cn: Quarkus生成的UUID在两次执行之间会发生变化(包括在dev模式下)。因此，您可以确定没有其他消费者使用它，而且每次您的应用程序启动时都会收到一个新的唯一的组ID。

source: Quarkus has a different extension for each Gateway API. The HTTP Gateway API is implemented within the `quarkus-amazon-lambda-http` extension. The REST Gateway API is implemented within the `quarkus-amazon-lambda-rest` extension. If you are confused on which Gateway product to use, Amazon has a https://docs.aws.amazon.com/apigateway/latest/developerguide/http-api-vs-rest.html[great guide] to help you navigate this decision.
zh_cn: Quarkus对每个网关API都有一个不同的扩展。HTTP网关API是在 `quarkus-amazon-lambda-http` 扩展中实现的。REST网关API是在 `quarkus-amazon-lambda-rest` 扩展中实现的。如果你对使用哪种网关产品感到困惑，亚马逊有一个 link:https://docs.aws.amazon.com/apigateway/latest/developerguide/http-api-vs-rest.html[很好的指南] 来帮助你做这个决定。

source: Quarkus has an integrated pluggable web security layer. If security is enabled all HTTP requests will have a permission check performed to make sure they are allowed to continue.
zh_cn: Quarkus有一个内置的可插拔的web安全层。如果安全功能被启用，所有的HTTP请求将会进行权限检查，以确保它们被允许继续操作。

source: Quarkus has been designed with this new world in mind and provides first-class support for these different paradigms. That does not mean you cannot build monoliths with Quarkus; you can do it smoothly. On the contrary, it means that the Quarkus development model morphs to adapt itself to the type of application you are developing, monolith, microservice, reactive, event-driven, functions…
zh_cn: Quarkus的设计考虑到了这个新的世界，并为这些不同的范式提供了一流的支持。这并不意味着你不能用Quarkus建立单体；你可以顺利地做到这一点。反而这意味着Quarkus的开发模型会变化，来适应您正在开发的应用程序的类型，单片机、微服务、响应式、事件驱动、无服务......

source: Quarkus has built-in capabilities to deal with JSON AMQP messages.
zh_cn: Quarkus有内置的功能来处理JSON AMQP消息。

source: Quarkus has built-in capabilities to deal with JSON Kafka messages.
zh_cn: Quarkus有内置的能力来处理JSON格式的Kafka消息。

source: Quarkus has built-in support for JSON serialization and deserialization based on Jackson. It will also <<serialization-generation, generate>> the serializer and deserializer for you, so you do not have to configure anything. When generation is disabled, you can use the provided `ObjectMapperSerializer` and `ObjectMapperDeserializer` as explained below.
zh_cn: Quarkus内置了对基于Jackson的JSON序列化和反序列化的支持。它也会为您 link:#serialization-generation[生成] 序列化器和反序列化器，所以您不需要配置任何东西。当生成器被禁用时，您可以提供 `ObjectMapperSerializer` 和 `ObjectMapperDeserializer` ，如下所述。

source: Quarkus has more Spring compatibility features. See the following guides for more details:
zh_cn: Quarkus拥有更多的Spring兼容特性。获取更多细节请参阅以下指南:

source: Quarkus heavily utilizes https://github.com/wildfly/jandex[Jandex] at build time, to discover various classes or annotations. One immediately recognizable application of this, is CDI bean discovery. As a result, most of the Quarkus extensions will not work properly if this build time discovery isn't properly setup.
zh_cn: Quarkus在构建时大量使用 link:https://github.com/wildfly/jandex[Jandex] ，以发现各种类或注解。其中一个应用就是可以发现并识别CDI Bean。因此，如果没有在构建时正确设置，大多数Quarkus扩展将无法正常工作。

source: Quarkus includes an extension that allows developers to use Kubernetes ConfigMaps and Secrets as a configuration source, without having to mount them into the Pod running the Quarkus application or make any other modifications to their Kubernetes Deployment (or Openshift DeploymentConfig) <a href="{{site.baseurl}}/guides/kubernetes-config">Read the guide for more details.</a>
zh_cn: Quarkus包含一个扩展，允许开发者使用Kubernetes ConfigMaps和Secrets作为配置源，而无需将它们挂载到运行Quarkus应用的Pod中，也无需对Kubernetes的部署(或Openshift DeploymentConfig)进行任何修改。<a href="{{site.baseurl}}/guides/kubernetes-config">阅读指南了解更多细节</a>

source: Quarkus is a _Reactive_ framework. Since the beginning, _Reactive_ has been an essential tenet of the Quarkus architecture. It includes many reactive features and offers a broad ecosystem.
zh_cn: Quarkus是一个 _Reactive_ 框架。 从一开始，_Reactive_ 就一直是Quarkus架构的基本原则。 它包括许多反应式功能，并提供广泛的生态系统。

source: Quarkus is an Open Source project licensed under the <a href="https://www.apache.org/licenses/LICENSE-2.0">Apache License version 2.0</a>. First and foremost, it is an open community where contributions, ideas and discussions are done in the open and contributors are welcome. Let’s join forces in building the future of Java applications.
zh_cn: Quarkus是一个在<a href="https://www.apache.org/licenses/LICENSE-2.0">Apache许可证2.0版</a>下许可的开源项目。首先，它是一个开放的社区，在这里，贡献、想法和讨论都是公开进行的，并且欢迎贡献者。让我们携手共建Java应用的未来。

source: Quarkus is an Open Source project licensed under the https://www.apache.org/licenses/LICENSE-2.0[Apache License version 2.0].
zh_cn: Quarkus是一个使用https://www.apache.org/licenses/LICENSE-2.0[Apache License 2.0版]授权的开源项目。

source: Quarkus is an ecosystem made from many extensions and many libraries (like Eclipse Vert.x, Hibernate, Apache Camel and more), most of them not under the direct responsibility of the Quarkus team. If you find a security bug possibly rooted in one of these libraries, you can either disclose to them directly or disclose them to the Quarkus team (following this process) and we will responsibly disclose the issue to the respective extension or library maintainer.
zh_cn: Quarkus是一个由许多扩展和许多库组成的生态系统（如Eclipse Vert.x, Hibernate, Apache Camel等），其中大多数都不是由Quarkus团队直接负责的。如果您发现一个安全漏洞可能根植于这些库中的一个，您可以直接向他们披露，也可以向Quarkus团队披露（遵循此过程），我们将负责地向相应的扩展或库维护人员披露问题。

source: Quarkus is an open ecosystem and we hope to see all the extensions people need to write their apps. We are working as we speak to allow an extension to be published in separate repos and separate GAVs and thus published in Maven repos independently of Quarkus core. This will greatly simplify the publication process. Expect news soon.
zh_cn: Quarkus是一个开放的生态系统，我们希望看到人们编写应用程序所需的所有扩展。我们正在工作，正如我们所说，允许一个扩展在单独的repo和单独的GAV中发布，从而在Maven repo中独立于Quarkus核心发布。这将大大简化发布过程，期待很快有新消息。

source: Quarkus is designed to seamlessly combine the familiar imperative style code and the non-blocking, reactive style when developing applications.
zh_cn: Quarkus的设计是为了在开发应用程序时将熟悉的指令式和非阻塞的响应式代码无缝结合起来。

source: Quarkus is not just about being great for writing Web Applications or Micro-Services. We’re focusing on more than the feature set: we make sure that every feature works well, simply, with little to no configuration, in the most intuitive way possible. It should be trivial to develop simple things, and easy to develop the more complex ones.
zh_cn: Quarkus不仅仅是为编写网络应用程序或微服务提供良好的条件。我们关注的不仅仅是功能集：我们要确保每个功能都能很好地工作，简单地工作，几乎不需要配置，以最直观的方式进行。开发简单的东西应该是微不足道的，而开发更复杂的东西应该是容易的。

source: Quarkus is not limited to HTTP. You can use <a href="https://quarkus.io/guides/grpc-getting-started">gRPC</a> or <a href="https://quarkus.io/guides/smallrye-graphql">GraphQL</a>, two prominent alternatives in the microservice space.
zh_cn: Quarkus并不局限于HTTP。您可以使用<a href="https://quarkus.io/guides/grpc-getting-started">gRPC</a>或<a href="https://quarkus.io/guides/smallrye-graphql">GraphQL</a>，这是微服务领域的两个突出的替代方案。

source: Quarkus is published in Maven Central, check out link:/extensions[which extensions] you need and just import them in your `pom.xml` to get Quarkus. We recommend you start your Quarkus experience via our link:/get-started[Getting Started guides].
zh_cn: Quarkus发布在Maven Central中，请查看 link:/extensions[扩展]，只需将它们导入到 `pom.xml`中就可以获得Quarkus。我们建议您通过我们的 link:/get-started[入门指南]开始您的Quarkus体验。

source: Quarkus is stable?
zh_cn: Quarkus稳定吗?

source: Quarkus lambdas can be deployed using the Amazon Java Runtime, or you can build a native executable and use Amazon's Custom Runtime if you want a smaller memory footprint and faster cold boot startup time.
zh_cn: Quarkus lambdas可以使用Amazon Java Runtime进行部署，如果你想要更小的内存占用和更快的冷启动启动时间，你也可以构建一个本地可执行文件，并使用Amazon的Custom Runtime。

source: Quarkus leverages SmallRye Health, an implementation of the MicroProfile Health specification. This allows applications to provide information about their state to external viewers in a Kubernetes environment where automated processes must be able to determine whether the application should be discarded or restarted. <a href="{{site.baseurl}}/guides/microprofile-health">Read the guide for more details.</a>
zh_cn: Quarkus利用SmallRye Health，这是MicroProfile Health规范的一个实现。这允许应用程序在Kubernetes环境中向外部查看者提供有关其状态的信息，在这种环境中，自动化流程必须能够确定应用程序是否应该被丢弃或重新启动。 <a href="{site.baseurl}}/guides/microprofile-health">阅读该指南以了解更多细节</a>

source: Quarkus makes it easy to deploy microservice applications to Kubernetes without having to understand the intricacies of the underlying Kubernetes framework. Extensions are available for Kubernetes, and Kubernetes distributions, to facilitate this process with only a minimal amount of configuration variables needed.
zh_cn: Quarkus使得在Kubernetes上部署微服务应用变得容易，而不需要了解Kubernetes底层框架的复杂性。Kubernetes和Kubernetes发行版都有相应的扩展，以促进这个过程，只需要最小的配置变量。

source: Quarkus makes registration of reflection in an extension a breeze by using `ReflectiveClassBuildItem`, thus eliminating the need for a JSON configuration file.
zh_cn: Quarkus通过使用 `ReflectiveClassBuildItem` ，使得在扩展中注册反射变得轻而易举，从而消除了对JSON配置文件的需求。

source: Quarkus now has extensions for DynamoDB, S3, SNS and SQS (more coming). Please check link:{amazon-services-guide}[those guides] on how to use the various AWS Services with Quarkus, as opposed to wiring manually like below.
zh_cn: Quarkus现在有DynamoDB、S3、SNS和SQS的扩展（还会有更多）。请查看 link:{amazon-services-guide}[那些指南] 关于如何使用带有Quarkus的各种AWS服务 ，而不是像下面这样手动连接。

source: Quarkus offers the possibility to use YAML in addition to the standard Java Properties file.
zh_cn: 除了标准的 Java Properties 文件之外，Quarkus 还提供了使用 YAML 的能力。

source: Quarkus offers unequaled performance
zh_cn: Quarkus提供了无与伦比的性能

source: Quarkus only implements a subset of the CDI features and comes with non-standard features and specific APIS, you can learn more about it in the xref:cdi-reference.adoc[Contexts and Dependency Injection guide].
zh_cn: Quarkus只实现了CDI功能的一个子集，并且带有非标准的功能和特定的APIS，你可以在 link:cdi-reference.html[Contexts和依赖注入指南] 中了解更多。

source: Quarkus performs some magic when it is capable of inferring the serialized types from the REST methods. When you have the following REST method, Quarkus determines that `Fruit` will be serialized:
zh_cn: 当Quarkus能够从REST方法中推断出序列化的类型时，它会发挥一些作用。当你有以下的REST方法时，Quarkus确定 `Fruit` 将被序列化：

source: Quarkus provides a cohesive, fun to use, full-stack framework by leveraging a growing list of hundreds of best-of-breed libraries that you love and use. All wired on a standard backbone.
zh_cn: Quarkus提供了一个内聚的、使用起来有趣的全栈框架，它利用了您所喜爱和使用的数百个最佳组合库，都将其连接在一个标准主干上。

source: Quarkus provides a cohesive, fun to use, full-stack framework by leveraging a growing list of over fifty best-of-breed libraries that you love and use. All wired on a standard backbone.
zh_cn: Quarkus提供了一个有凝聚力的、有趣的、全栈式的框架，它利用了各类不断增长的50多个你喜欢和使用的最好的库。所有这些都在一个标准的主干上。

source: Quarkus provides a compatibility layer for Spring Cloud Config in the form of the spring-cloud-config-client extension.
zh_cn: Quarkus以spring-cloud-config-client扩展的形式为Spring Cloud Config提供了一个兼容层。

source: Quarkus provides a distroless base image that you can use in your `Dockerfile`. You only need to copy your application, and you are done:
zh_cn: Quarkus提供了一个无发行版的基础镜像，可以用于你的 `Dockerfile` 。你只需要复制你的应用程序，就可以了：

source: Quarkus provides a few implementations of `QuarkusTestResourceLifecycleManager` out of the box (see `io.quarkus.test.h2.H2DatabaseTestResource` which starts an H2 database, or `io.quarkus.test.kubernetes.client.KubernetesServerTestResource` which starts a mock Kubernetes API server), but it is common to create custom implementations to address specific application needs. Common cases include starting docker containers using https://www.testcontainers.org/[Testcontainers] (an example of which can be found https://github.com/quarkusio/quarkus/blob/main/test-framework/keycloak-server/src/main/java/io/quarkus/test/keycloak/server/KeycloakTestResourceLifecycleManager.java[here]), or starting a mock HTTP server using https://wiremock.org/[Wiremock] (an example of which can be found https://github.com/geoand/quarkus-test-demo/blob/main/src/test/java/org/acme/getting/started/country/WiremockCountries.java[here]).
zh_cn: Quarkus提供了一些开箱即用的 `QuarkusTestResourceLifecycleManager` （见 `io.quarkus.test.h2.H2DatabaseTestResource` ，它启动了一个H2数据库；或 `io.quarkus.test.kubernetes.client.KubernetesServerTestResource` ，它启动了一个模拟的Kubernetes API服务器），但创建自定义的实现来满足特定的应用需求也是很常见的。常见的情况包括使用 link:https://www.testcontainers.org/[Testcontainers] 启动docker容器（例子 link:https://github.com/quarkusio/quarkus/blob/main/test-framework/keycloak-server/src/main/java/io/quarkus/test/keycloak/server/KeycloakTestResourceLifecycleManager.java[见这里] ），或使用 link:http://wiremock.org/[Wiremock] 启动一个模拟的HTTP服务器（例子 link:https://github.com/geoand/quarkus-test-demo/blob/main/src/test/java/org/acme/getting/started/country/WiremockCountries.java[见这里] ）。

source: Quarkus provides comprehensive HashiCorp Vault support. For more information, see the link:{vault-guide}[Quarkus and HashiCorp Vault] documentation.
zh_cn: Quarkus提供了非常全面的HashiCorp Vault支持，请参见 link:{vault-guide}[Quarkus和HashiCorp Vault] 文档以了解更多信息。

source: Quarkus provides developers the tools and capabilities to troubleshoot distributed microservices applications in Kubernetes including tracing and debugging.
zh_cn: Quarkus为开发者提供了工具和能力，以解决Kubernetes中分布式微服务应用程序的故障，包括跟踪和调试。

source: Quarkus provides first class support for using Flyway as will be explained in this guide.
zh_cn: 本指南将会介绍Quarkus为使用Flyway提供了哪些一流的支持。

source: Quarkus provides first class support for using Kotlin as will be explained in this guide.
zh_cn: Quarkus为使用Kotlin提供了一流的支持，本指南将对此进行讲解。

source: Quarkus provides mutual TLS (mTLS) authentication so that you can authenticate users based on their X.509 certificates. For more information, see xref:security-built-in-authentication.adoc#mutual-tls[mutual TLS authentication].
zh_cn: Quarkus提供了TLS互认证，这样您就可以根据用户的X.509证书进行认证。更多信息请参见 link:security-built-in-authentication.html#mutual-tls[TLS互认证] 。

source: Quarkus provides other ways to serve static files. This is an example made for the guide.
zh_cn: Quarkus提供了其他方式来处理静态文件。这是专为该指南制作的一个例子。

source: Quarkus provides several health checks for Kafka. These checks are used in combination with the `quarkus-smallrye-health` extension.
zh_cn: Quarkus为Kafka提供了几种健康检查方式。这些方式需要与 `quarkus-smallrye-health` 扩展结合使用。

source: Quarkus provides support for Apache Kafka through https://smallrye.io/smallrye-reactive-messaging/[SmallRye Reactive Messaging] framework. Based on Eclipse MicroProfile Reactive Messaging specification 2.0, it proposes a flexible programming model bridging CDI and event-driven.
zh_cn: Quarkus通过 link:https://smallrye.io/smallrye-reactive-messaging/[SmallRye Reactive Messaging] 框架为Apache Kafka提供支持。基于Eclipse MicroProfile Reactive Messaging 2.0 规范，框架提供了一种灵活的基于CDI和事件驱动的编程模型。

source: Quarkus provides support for live reloading changes made to source code. This support is also available to Kotlin, meaning that developers can update their Kotlin source code and immediately see their changes reflected.
zh_cn: Quarkus提供了对源代码的实时重载修改的支持。这种支持也适用于Kotlin，这意味着开发者可以更新他们的Kotlin源代码，并立即看到代码更改带来的反馈。

source: Quarkus provides the `quay.io/quarkus/quarkus-distroless-image:1.0` image. It contains the required packages to run a native executable and is only **9Mb**. Just add your application on top of this image, and you will get a tiny container image.
zh_cn: Quarkus提供了 `quay.io/quarkus/quarkus-distroless-image:1.0` 镜像。它包含了运行原生可执行文件所需的软件包，并且只有 *9Mb* 。只要在这个镜像上添加你的应用程序，你就会得到一个很小的容器镜像。
